Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: This approach also makes it easier to pull out or revert one of the changesets if you need to later.
cs: Takový přístup současně usnadňuje stahování změn (pull) nebo vracení jedné sady změn do původního stavu -- bude-li to později třeba.

source: This approach is very common because it is so simple, but it is also incredibly error prone.
cs: Takový přístup je velmi častý, protože je jednoduchý, ale je také velmi náchylný k chybám.

source: This basically asks Git to resolve a range of commits that are reachable from one commit but aren’t reachable from another.
cs: Pomocí ní systému Git v podstatě říkáte, aby uvažoval celý interval revizí, které jsou dostupné z jedné revize, ale nejsou dostupné z jiné.

source: This basically says, ``Check out the client branch, figure out the patches from the common ancestor of the `client` and `server` branches, and then replay them onto `master`.'' It's a bit complex, but the result is pretty cool.
cs: V podstatě tím říkáte: „Přepni se (checkout) na větev `client`, zjisti záplaty od společného předka větví `client` a `server` a znovu je aplikuj na větev `master`.“ Je to možná trochu složitější, ale výsledek stojí za to.

source: This book covers how to use Git with 30 or so verbs such as `checkout`, `branch`, `remote`, and so on.
cs: V této knize jsme dosud uvedli asi 30 příkazů, které se používají k ovládání systému Git, např. `checkout`, `branch` nebo `remote`.

source: This can also be written `HEAD^^^`, which again is the first parent of the first parent of the first parent:
cs: Totéž by bylo možné označit výrazem `HEAD^^^`, který opět udává prvního rodiče prvního rodiče prvního rodiče:

source: This can be confusing, because if you've staged all of your changes, `git diff` will give you no output.
cs: Může to být matoucí, protože pokud jste všechny provedené změny připravili k zapsání, bude výstup příkazu `git diff` prázdný.

source: This can take a while.
cs: Proces může chvíli trvat.

source: This can take several seconds or even minutes, depending on the size of the project, whereas in Git the process is always instantaneous.
cs: To může zabrat několik sekund nebo dokonce minut -- v závislosti na velikosti projektu --{empty}, zatímco v Gitu tento proces proběhne vždy okamžitě.

source: This chapter covers every basic command you need to do the vast majority of the things you'll eventually spend your time doing with Git.
cs: Tato kapitola popisuje všechny základní příkazy, které potřebujete pro drtivou většinu věcí, jejichž prováděním budete v Gitu trávit svůj čas.

source: This chapter will be about getting started with Git.
cs: Tato kapitola pojednává o tom, jak se systémem Git začít.

source: This combination effectively filters all C source code files through `indent` before committing.
cs: Tato kombinace ještě před zapsáním účinně přefiltruje veškeré zdrojové soubory pro jazyk C přes program `indent`.

source: This command also exits with a non-zero status if the check fails, so you can use it in scripts if you want.
cs: Jestliže kontrola selže, příkaz vrací nenulový návratový kód, a proto ho lze snadno používat ve skriptech.

source: This command compares your staged changes to your last commit:
cs: Tento příkaz porovná změny připravené k zapsání vůči poslední zapsané revizi:

source: This command does not reach out to the servers, it's telling you about what it has cached from these servers locally.
cs: Příkaz se nesnaží o navázání kontaktu se serverem. Říká vám jen to, co je pro uvedené servery uchováno lokálně.

source: This command gives you a diff, but it may be misleading.
cs: Výstupem tohoto příkazu bude výpis diff, který však může být lehce matoucí.

source: This command is sort of a Swiss army knife for inspecting Git objects.
cs: Tento příkaz je něco jako švýcarský nůž k prohlížení objektů Git.

source: This command lists the tags in alphabetical order; the order in which they appear has no real importance.
cs: Tento příkaz vypíše značky v abecedním pořadí. Pořadí zobrazení značek nenese žádnou důležitou informaci.

source: This command looks up which server ``origin'' is (in this case, it's `git.ourcompany.com`), fetches any data from it that you don't yet have, and updates your local database, moving your `origin/master` pointer to its new, more up-to-date position.
cs: Tento příkaz zjistí, který server je `origin` (v tomto případě je to `git.ourcompany.com`), vyzvedne z něj všechna data, která ještě nemáte, a aktualizuje vaši lokální databázi. Při tom přemístí ukazatel `origin/master` na novou, aktuálnější pozici.

source: This command puts conflict markers in any files it has issues with, much like a conflicted merge or rebase operation.
cs: Tento příkaz vloží poznámku o konfliktu (conflict marker) do všech souborů, u nichž došlo k problémům, stejně jako u operací sloučení nebo přeskládání, při nichž došlo ke konfliktu.

source: This command reads simple instructions from stdin to write specific Git data.
cs: Tento příkaz načítá ze vstupů stdin jednoduché instrukce k zapsáni specifických dat systému Git.

source: This command removes all files that end with `~`.
cs: Tento příkaz odstraní všechny soubory, které končí vlnovkou (`~`).

source: This command removes all files that have the `.log` extension in the `log/` directory.
cs: Uvedeným příkazem odstraníte všechny soubory s příponou `.log` z adresáře `log/`.

source: This command shows which branch is automatically pushed to when you run `git push` while on certain branches.
cs: Tento příkaz ukazuje, která větev bude automaticky odeslána, pokud spustíte příkaz `git push` na určitých větvích.

source: This command shows you any commits in your current branch that aren’t in the `master` branch on your `origin` remote.
cs: Tento příkaz zobrazí všechny revize ve vaší aktuální větvi, které nejsou obsaženy ve větvi `master` vzdáleného repozitáře `origin`.

source: This command shows you only the work your current topic branch has introduced since its common ancestor with master.
cs: Tento příkaz zobrazí pouze práci, která byla ve vaší aktuální tématické větvi provedena od chvíle, kdy se oddělila od hlavní větve.

source: This command takes your staging area and uses it for the commit.
cs: Tento příkaz vezme vaši oblast připravených změn a použije ji k vytvoření revize.

source: This command uses GPG to verify the signature.
cs: Tento příkaz využívá k ověření podpisu program GPG.

source: This command will apply the other two commits automatically, and then you’re done.
cs: Tento příkaz automaticky aplikuje zbývající dvě revize. Tím je celý proces dokončen.

source: This command works only if you cloned from a server to which you have write access and if nobody has pushed in the meantime.
cs: Tento příkaz bude funkční, pouze pokud jste klonovali ze serveru, k němuž máte oprávnění pro zápis, a pokud tam mezi tím nikdo nic neodeslal.

source: This command works with lots of formats – you can specify a specific date like `"2008-01-15"`, or a relative date such as `"2 years 1 day 3 minutes ago"`.
cs: Tento příkaz pracuje s velkým množstvím formátů. Můžete zadat konkrétní datum (`"2008-01-15"`) nebo relativní datum, jako je `"2 years 1 day 3 minutes ago"` (před 2 roky, 1 dnem a 3 minutami).

source: This commit is fine, and now Git has all the information it needs to determine where the issue was introduced.
cs: Tato revize je v pořádku, a Git tak má nyní všechny informace, které potřebuje k určení, kde problém vznikl.

source: This concept is as true in Git as it is in Subversion(((Subversion))) (or any CVCS), and this model works perfectly well in Git.
cs: Tento koncept platí jak pro Git, tak pro Subversion(((Subversion))) (nebo pro jiný systém pro správu verzí). Bez problémů funguje i v Gitu.

source: This config file can only be changed by `git config -f <file>` as an admin.
cs: Tento soubor můžete upravovat jen pokud jste správce a to příkazem `git config -f <soubor>`.

source: This creates a new subdirectory named `.git` that contains all of your necessary repository files – a Git repository skeleton.
cs: Příkaz vytvoří nový podadresář s názvem `.git`, který bude obsahovat všechny soubory nezbytné pro repozitář, tzv. kostru repozitáře Git.

source: This does the equivalent of the `svn copy trunk branches/opera` command in Subversion and operates on the Subversion server.
cs: Příkaz je ekvivalentní s příkazem `svn copy trunk branches/opera` v systému Subversion a pracuje na serveru Subversion.

source: This effectively makes nice text-based versions of your Word files before attempting to diff them.
cs: Než se Git pokusí zjistit ve wordovských souborech rozdíly, dojde k jejich převedení na hezké textové verze.

source: This entire chapter basically deals with the stuff in this directory.
cs: Celá tato kapitola se bude zabývat v podstatě jen obsahem tohoto adresáře.

source: This example uses the `-L` option to limit the output to lines 12 through 22:
cs: Následující příklad používá parametr `-L`, který omezí výstup na řádky 12 až 22:

source: This file is written by the `update-server-info` command, which is why you need to enable that as a `post-receive` hook in order for the HTTP transport to work properly:
cs: Tento soubor se zapisuje příkazem `update-server-info`. To je také důvod, proč ho je nutné zapnout jako zásuvný modul `post-receive`, aby přenos dat prostřednictvím protokolu probíhal správně:

source: This first example describes contributing via forking on Git hosts that support easy forking.
cs: První příklad popisuje, jak se přispívá s využitím odštěpení (fork) na gitovských hostitelských serverech, které podporují snadné vytváření odštěpených projektů.

source: This functionality is built into Git at the lowest levels and is integral to its philosophy.
cs: Tato funkčnost je do Gitu zabudována na nejnižších úrovních a je nedílnou součástí jeho filosofie.

source: This gives you a local branch that you can work on that starts where `origin/serverfix` is.
cs: Tímto způsobem získáte lokální větev, na níž můžete pracovat a která začíná na pozici `origin/serverfix`.

source: This goes through and rewrites every commit to have your new address.
cs: Příkaz projde a přepíše všechny revize tak, aby obsahovaly novou adresu.

source: This helps make the data more useful:
cs: Díky tomu získáte k datům další užitečné informace:

source: This hook can likewise validate the presence of files external to Git control that you may want copied in when the working tree changes.
cs: Zásuvný modul může rovněž ověřit přítomnost souborů nezahrnutých do správy verzí systému Git, které možná budete chtít po změnách v pracovním stromě zkopírovat.

source: This is a bit of a shortcut.
cs: Toto je zkrácená verze příkazu.

source: This is a common enough operation that git provides the `--track` shorthand:
cs: Jde o natolik běžnou operaci, že k ní Git nabízí zkratkový příkaz `--track`:

source: This is a configuration file that stores the mapping between the project’s URL and the local subdirectory you’ve pulled it into:
cs: Jedná se o konfigurační soubor, v němž je uloženo mapování mezi adresou URL projektu a lokálním podadresářem, do nějž jste stáhli repozitář.

source: This is a nice shortcut to recover stashed work easily and work on it in a new branch.
cs: Jedná se o příjemný a jednoduchý způsob, jak obnovit odloženou práci a pokračovat na ní v nové větvi.

source: This is a powerful tool that can help you check hundreds of commits for an introduced bug in minutes.
cs: Tento příkaz představuje výkonný nástroj, který vám pomůže vyhledat zavlečenou chybu mezi stovkami revizí za pár minut.

source: This is a safety feature to prevent accidental removal of data that hasn't yet been recorded in a snapshot and that can't be recovered from Git.
cs: Jde o funkci zvyšující bezpečnost tím, že brání nechtěnému odstranění dat, která ještě nebyla zaznamenána do snímku, a proto by nemohla být Gitem obnovena.

source: This is a special daemon that comes packaged with Git; it listens on a dedicated port (9418) that provides a service similar to the SSH protocol, but with absolutely no authentication.
cs: Je to speciální démon, který je distribuován spolu se systémem Git. Naslouchá na vyhrazeném portu (9418) a poskytuje podobnou službu jako protokol SSH, avšak bez jakékoliv autentizace.

source: This is also a nice option for quickly grabbing work from someone else's working repository.
cs: Je to taky šikovná možnost rychlého získání práce z pracovního repozitáře někoho jiného.

source: This is also not limited to small teams.
cs: A není také omezen jen na malé týmy.

source: This is also useful if you have multiple packfiles on the server, so you can see which packfile contains the object you need:
cs: To je rovněž užitečné, máte-li na serveru více balíčkových souborů. Zjistíte tak, který z nich obsahuje hledaný objekt:

source: This is always the last option and is generally preceded by double dashes (`--`) to separate the paths from the options.
cs: Cesta je vždy posledním parametrem a většinou jí předcházejí dvě pomlčky (`--`) , jimiž je oddělena od ostatních parametrů.

source: This is an important distinction between Git and nearly all other VCSs.
cs: Jde o důležitý rozdíl mezi systémem Git a téměř všemi ostatními systémy pro správu verzí.

source: This is an important distinction – instead of getting just a working copy, Git receives a full copy of nearly all data that the server has.
cs: Tento rozdíl je podstatný. Místo pouhého získání pracovní kopie souborů projektu, získá Git plnou kopii téměř všech dat na serveru.

source: This is an important point to remember: when you switch branches, Git resets your working directory to look like it did the last time you committed on that branch.
cs: Zapamatujte si následující důležitý bod: když přepínáte větve, Git nastavuje obsah pracovního adresáře tak, aby vypadal stejně jako v době, kdy jste v dané větvi prováděli poslední zápis.

source: This is an important section to absorb, because if you understand what Git is and the fundamentals of how it works, then using Git effectively will probably be much easier for you.
cs: Pochopení této podkapitoly je důležité, protože pokud porozumíte, co Git je a na jakých základech pracuje, bude pro vás i jeho efektivní používání mnohem snadnější.

source: This is basically the `git log` command, but by default it prints out only the SHA-1 values and no other information.
cs: Tento příkaz má v podstatě stejnou funkci jako `git log`, jeho výstupem jsou ale pouze hodnoty SHA-1 bez dalších informací.

source: This is basically the commit checksum stored in a file – no other information is kept.
cs: Jde v podstatě o kontrolní součet revize uložený v souboru -- žádné další informace neobsahuje.

source: This is because Windows uses both a carriage-return character and a linefeed character for newlines in its files, whereas Mac and Linux systems use only the linefeed character.
cs: Windows ve svých souborech používá pro nové řádky jak znak pro návrat vozíku (carriage return), tak znak pro posun o řádek (linefeed), zatímco systémy Mac a Linux používají pouze znak posun o řádek.

source: This is called a _refspec_.
cs: Říká se tomu _refspec_.

source: This is called a ``patch-id''.
cs: Jmenuje se to „patch-id“ (doslova „identifikace záplaty“).

source: This is especially important to understand if you're used to Subversion, because you'll notice that the two developers didn't edit the same file.
cs: Pochopit to je obzvlášť důležité v případě, kdy jste zvyklí na Subversion. Můžete si totiž všimnout, že oba vývojáři neupravovali stejný soubor.

source: This is especially useful when you're generating output for machine parsing – because you specify the format explicitly, you know it won't change with updates to Git:(((log formatting)))
cs: Je to užitečné zejména v situaci, kdy generujete výstup pro strojové zpracování -- formát předepisujete explicitně, takže máte jistotu, že se s aktualizací Gitu nezmění:(((log formátování)))

source: This is fine if the whole thing is source code, because Git is highly optimized to compress that data efficiently.
cs: Je však jedna věc, která vám může způsobovat problém.

source: This is generally straightforward to do.
cs: S tím obvykle nebývá problém.

source: This is helpful if a branch in your project has diverged or is specialized, but you want to be able to merge changes back in from it, and you want to ignore certain files.
cs: Tuto možnost využijete, pokud se rozdělila nebo specializovala některá z větví vašeho projektu, avšak vy z ní budete chtít začlenit změny zpět a ignorovat přitom určité soubory.

source: This is how other people who clone this project know where to get the submodule projects from.
cs: Ostatní uživatelé, kteří budou tento projekt klonovat, díky tomu zjistí, kde najdou projekty submodulů.

source: This is important because every Git commit uses this information, and it's immutably baked into the commits you start creating:
cs: Je to důležité, protože tuto informaci Git používá pro každý zápis revize (commit) a uvedené údaje se stanou trvalou součástí objektů revize, které budete vytvářet:

source: This is important because it means that all the SHA-1 checksums for your commits change.
cs: To je důležité, protože to znamená, že se změní všechny kontrolní součty SHA-1 vašich revizí.

source: This is important because with more and more developers, you run into more issues with making sure your code applies cleanly or can be easily merged.
cs: Počet přispěvatelů je důležitý, protože s rostoucím počtem vývojářů narůstají i potíže se zajištěním toho, aby byl váš kód aplikován čistě, nebo aby ho bylo možné snadno začlenit (merge).

source: This is in sharp contrast to the way most older VCS tools branch, which involves copying all of the project's files into a second directory.
cs: Ostře to kontrastuje se způsobem větvení ve většině starších systémů pro správu verzí, který zahrnoval kopírování všech souborů projektu do druhého adresáře.

source: This is interesting, because now your `testing` branch has moved forward, but your `master` branch still points to the commit you were on when you ran `git checkout` to switch branches.
cs: Výsledek je zajímavý z toho důvodu, že se větev `testing` posunula vpřed, zatímco větev `master` stále ukazuje na revizi, na níž jste se nacházeli před přepnutím větví příkazem `git checkout`.

source: This is just the default refspec for `git fetch` for that remote.
cs: Toto je výchozí vzorec refspec pro příkaz `git fetch` pro tento vzdálený server.

source: This is like `blame` and `log` in that it runs offline and is up to date only as of the last time you communicated with the Subversion server.
cs: Stejně jako v případě příkazů `blame` a `log` pracuje i tento příkaz offline a zobrazuje stav v okamžiku, kdy jste naposledy komunikovali se serverem Subversion.

source: This is much like specifying `git diff --cached` on the command line:
cs: Je to prakticky totéž, jako byste na příkazovém řádku zadali příkaz `git diff --cached`:

source: This is necessary because Git does its own filename expansion in addition to your shell's filename expansion.
cs: Je to nezbytné, protože Git provádí své vlastní nahrazování masek souborů (kromě toho, které provádí shell).

source: This is nice because with this syntax you can specify more than two references in your query, which you cannot do with the double-dot syntax.
cs: Tato syntaxe je užitečná zejména proto, že pomocí ní můžete zadat více než dvě reference, což není pomocí dvojtečkové syntaxe možné.

source: This is often called a pull request, and you can either generate it via the website – GitHub has its own Pull Request mechanism that we'll go over in <<_github>> – or you can run the `git request-pull` command and email the output to the project maintainer manually.
cs: Často se tomu říká „pull request“, čili požadavek na stažení. Můžete ho vytvořit prostřednictvím webové stránky -- GitHub má svůj vlastní mechanismus Pull Request, kterým se budeme zabývat v kapitole <<_github>> -- nebo můžete spustit příkaz `git request-pull` a správci projektu ručně zaslat výstup příkazu e-mailem.

source: This is often used if everyone on your team has access to a shared filesystem such as an NFS mount, or in the less likely case that everyone logs in to the same computer.
cs: Často se využívá v případech, kdy mají všichni z vašeho týmu přístup k sdílenému souborovému systému (například přes NFS), nebo v méně pravděpodobném případě, kdy se všichni přihlašují na stejný počítač.

source: This is one of the few areas in Git where you may lose some work if you do it wrong.
cs: Je to jedna z mála oblastí, kdy při neuváženém postupu v Gitu riskujete, že přijdete o část své práce.

source: This is particularly useful if you forgot to add something to your `.gitignore` file and accidentally staged it, like a large log file or a bunch of `.a` compiled files.
cs: Může to být zvlášť užitečné, pokud jste něco zapomněli přidat do souboru `.gitignore` a omylem jste to zahrnuli do oblasti připravených změn -- například velký log soubor nebo spoustu zkompilovaných souborů s příponou `.a`.

source: This is really useful.
cs: Tato funkce je opravdu užitečná.

source: This is referred to as a merge commit, and is special in that it has more than one parent.
cs: Říká se mu bod sloučení (merge commit) a je zvláštní v tom, že má víc než jednoho rodiče.

source: This is roughly equivalent to something like
cs: Je to přibližně stejné, jako byste zadali například:

source: This is roughly the same script as the server-side part, but with two important differences.
cs: Jedná se o přibližně stejný skript, jaký funguje na serveru, avšak se dvěma podstatnými rozdíly.

source: This is shorthand for:
cs: Jde o zkratku pro příkazy:

source: This is something you've likely never done with a VCS before because it's generally too expensive to create and merge branches.
cs: Je to něco, co byste v dřívějších systémech pro správu verzí nikdy nedělali, protože v nich je vytváření a slučování větví většinou náročné.

source: This is the basic information that the commit object stores for you.
cs: Toto jsou základní informace, které obsahuje objekt revize.

source: This is the beginning of the output of the format-patch command that you saw in the previous section.
cs: Toto je začátek výstupu příkazu format-patch, s nímž jsme se setkali v předchozí části.

source: This is the camp that uses tools like rebase and filter-branch to tell the story in the way that's best for future readers.
cs: Zastánci tohoto tábora používají nástroje jako přeskládání a filtrování větví k tomu, aby příběh sdělili způsobem, který je nejlepší z hlediska budoucích čtenářů.

source: This is the main thing to remember about Git if you want the rest of your learning process to go smoothly.
cs: Pokud chcete dále hladce pokračovat ve studiu Gitu, budou pro vás následující informace stěžejní.

source: This is the most important part of Git, and it is what is copied when you clone a repository from another computer.
cs: Je to nejdůležitější část systému Git a zároveň je to adresář, který se zkopíruje, když klonujete repozitář z jiného počítače.

source: This is useful if you want to keep the `experiment` branch up to date and preview what you’re about to merge in.
cs: Tento log využijete, pokud chcete udržovat větev `experiment` stále aktuální a zjistit, co hodláte začlenit.

source: This is useful if you write your own tools that work with a Git repository.
cs: To je užitečné v případech, kdy si píšete své vlastní nástroje, které s repozitářem Gitu pracují.
